trade_exp/src/DataProcessors/РассылкаПисемОНачисленныхБонусныхБаллах/РассылкаПисемОНачисленныхБонусныхБаллах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РассылкаПисемОНачисленныхБонусныхБаллах</name>
</mdclass:DataProcessor>

trade_exp/src/AccumulationRegisters/БонусныеБаллы/БонусныеБаллы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e3cba07e-b273-45b0-98b0-fb46a8dc5694">
  <name>БонусныеБаллы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="c272e1ef-3e78-4217-a586-b04d493ae9c7">
    <name>Начислено</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="045d5c04-a494-4ce1-8feb-c971c832360d">
    <name>НачисленоСтатус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d25ef04e-457d-44fa-8725-25a813516807">
    <name>НачисленоКП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="372f8640-d32c-41d8-b10c-d2f1ae57a694">
    <name>НачисленоПрочее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d3b7c92b-14d3-4a4e-911a-d390d54c81e9">
    <name>КСписанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1758d045-4e77-4376-b4b7-f8c4d0745f49">
    <name>ВРезерве</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="eae49cfa-4bed-4293-959e-c0232deed12d">
    <name>Зарезервировано</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="27ad958d-13f3-4ed5-bfe8-57104e687aa8">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2ad6036-ba65-416c-b1ec-c8981b70ed01">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56c44fed-c51a-4f96-8f0e-631f22cadcde">
    <name>ДатаКОбработке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="d465f3dc-4b7b-40a0-970e-da046f213d6d">
    <name>БонуснаяПрограммаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f1f1f3cd-c388-438a-8a49-8e43fd10ced8">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/РезервБонусныхБаллов/РезервБонусныхБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d38b0690-00ef-4244-8840-0cb68dce4493">
  <name>РезервБонусныхБаллов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="23f7ed27-c7e3-497e-a5ac-60f4fa011391">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="aa0e0892-fef8-410d-ad5d-741b47e3476a">
    <name>СуммаБаллов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="c087c2f2-c875-4a2e-b167-e99fa9560f51">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="60ba4006-eb0f-44be-89fe-40d30e65df8f">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="667173ab-d9f2-4a1f-84ea-6967c4d252ae">
    <name>Реализация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2ded6678-db6a-414b-a0ef-9a23a7e0eeae">
    <name>КодСтроки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="8e330d35-8dee-4be2-ace4-c8723398d5dc">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57b31a5d-9fdc-43d2-ae81-67157822c4b6">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d4e2da66-9a70-459f-a873-cb4ad71d17b2">
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a84a91d2-d326-4bf4-82e6-d573ee35d090">
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="fef27478-ddfd-4ad9-8161-148761f29698">
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="39cbda23-db3f-4ddd-8981-8540247406db">
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c8a18d99-62ff-45a4-acb5-48e3310c1b53">
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a6eb0cb1-80f0-4390-80ff-7af53f8e63c3">
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ЭлектронноеПисьмоИсходящее/ЭлектронноеПисьмоИсходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЭлектронноеПисьмоИсходящее</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="97ec3768-2b7d-4032-a579-31ade741eb58">
    <name>ДатаКогдаОтправить</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b0f6ea83-2849-4151-930d-692866919db3">
    <name>ОтправительПредставление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2ee0d56b-cd7c-42db-8fb6-c1567fe1967d">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="de506523-241a-4845-9259-37066afbf16a">
    <name>Важность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="683861f9-9a5f-47db-8b03-959f839d5a3a">
    <name>Тема</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e19aefe7-634d-4218-8d40-75802d1691e0">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="edf11909-7d5f-4077-9cf1-90c3ef67cf64">
    <name>ДатаАктуальностиОтправки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0510206f-eef0-4a5e-aeb7-d53c26d34adb">
    <name>ДатаОтправления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="cdd59b15-d67d-4f1b-90d4-595a9547e61d">
    <name>Основания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="af5e1662-b91e-424b-8e69-e89337a96047">
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/DataProcessors/РассылкаПисемОНачисленныхБонусныхБаллах/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

 
 Функция СведенияОВнешнейОбработке() Экспорт
	 ОбъектыНазначенияФормы = Новый Массив;
	 ПараметрыРегистрации = Новый Структура;
	 ПараметрыРегистрации.Вставить("Вид","ДополнительнаяОбработка");
	 ПараметрыРегистрации.Вставить("Наименование","Рассылка писем о начисленных бонусных баллах");
	 ПараметрыРегистрации.Вставить("Версия","2.01");
	 ПараметрыРегистрации.Вставить("БезопасныйРежим",ЛОЖЬ);
	 ПараметрыРегистрации.Вставить("Информация","Рассылка писем о начисленных бонусных баллах");
	 
	 мНазначение= Новый Массив;
	 мНазначение.Добавить("Справочник.Партнеры");
	 мНазначение.Добавить("Документ.ЗаказКлиента");
	 ПараметрыРегистрации.Вставить("Назначение", мНазначение);
	 
	 ТаблицаКоманд = ПолучитьТаблицу_Команд();
	 
	 ДобавитьКоманду(ТаблицаКоманд,
	 "Отправить письмо о накомленных бонусах партенру",                
	 "ОтправкаПартнеру",  
	 "ОткрытиеФормы",    
	 Ложь,                        
	 "ОтправкаПартнеру",          
	 );
	 
	 ДобавитьКоманду(ТаблицаКоманд,
	 "Рассылка писем о начисленных бонусных баллах. Регламентное задание",                
	 "ЗапускПоРасписанию",        
	 "ВызовСерверногоМетода",    
	 Истина,                        
	 "ЗапускПоРасписанию",                 
	 );
	 
	 ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	 
	 Возврат ПараметрыРегистрации;
	 
 КонецФункции
 
 Функция ПолучитьТаблицу_Команд()
	 
	 Команды = Новый ТаблицаЗначений;
	 Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	 Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	 Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	 Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	 Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	 
	 Возврат Команды;
	 
 КонецФункции
 
 Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "", Назначение)
	 
	 НоваяКоманда = ТаблицаКоманд.Добавить();
	 НоваяКоманда.Представление = Представление;
	 НоваяКоманда.Идентификатор = Идентификатор;
	 НоваяКоманда.Использование = Использование;
	 НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	 НоваяКоманда.Модификатор = Модификатор;
	 
 КонецПроцедуры
 
 // Интерфейс для запуска логики обработки.
 Процедура ВыполнитьКоманду(ИдентификаторКоманды) Экспорт
	 Если ИдентификаторКоманды =  "ЗапускПоРасписанию" Тогда
		 ОтправитьПисьма();
	 КонецЕсли;
 КонецПроцедуры
 
Процедура ОтправитьПисьма() Экспорт
	 ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаПисемОНачисленныхБонусныхБаллах", УровеньЖурналаРегистрации.Примечание, , , "Начало отправки писем");
	 
	 УчетнаяЗапись= Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("tg-alterra2@yandex.ru", Истина);
	 
	 ВыборкаДетальныеЗаписи= ЗапросКБаллам();
	 
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 Почта= ВыборкаДетальныеЗаписи.Почта;
		 
		 Если Не ПроверкаАдресаПочты(Почта) Тогда
			 ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаПисемОНачисленныхБонусныхБаллах", УровеньЖурналаРегистрации.Примечание, , , "У партнера "+ВыборкаДетальныеЗаписи.Партнер+" не корректно задана почта: "+Почта);
			 Продолжить;
		 КонецЕсли;
		 
		 Попытка
			 Письмо=  Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
			 
			 Почта= "bespalov.alexey@ya.ru";

			 СкрытаяПочта= "";
			 СкрытаяПочта= "ryabushkina@tg-alterra.ru";
			 
			 ЗаполнитьПисьмо(Письмо, ВыборкаДетальныеЗаписи, Почта, СкрытаяПочта);
			 
			 Письмо.Записать();
			 
			 
			 ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаПисемОНачисленныхБонусныхБаллах", УровеньЖурналаРегистрации.Примечание, , , "Отправлено письмо на адресс: "+Почта);
		 Исключение
			 ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаПисемОНачисленныхБонусныхБаллах", УровеньЖурналаРегистрации.Примечание, , , "Не удалось отправить письмо на адресс: "+Почта);
		 КонецПопытки;
	 КонецЦикла;
	 
	 ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаПисемОНачисленныхБонусныхБаллах", УровеньЖурналаРегистрации.Примечание, , , "Окончание отправки писем");
 КонецПроцедуры
 
 Функция ЗапросКБаллам() 
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	БонусныеБаллыОстаткиИОбороты.Партнер КАК Партнер,
	 |	ЕСТЬNULL(ПартнерыКонтактнаяИнформация.АдресЭП, """") КАК Почта,
	 |	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоНачальныйОстаток) КАК КоличествоНачальныйОстаток,
	 |	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоПриход) КАК КоличествоПриход,
	 |	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоРасход) КАК КоличествоРасход,
	 |	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоКонечныйОстаток) КАК КоличествоКонечныйОстаток,
	 |	СУММА(ВЫБОР
	 |			КОГДА РезервБонусныхБаллов.Реализация = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	 |				ТОГДА РезервБонусныхБаллов.СуммаБаллов
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ВРезервеКонечныйОстаток,
	 |	БонусныеБаллыОстаткиИОбороты.Партнер.Наименование КАК КлиентФИО
	 |ИЗ
	 |	РегистрНакопления.БонусныеБаллы.ОстаткиИОбороты(&Дата1, &Дата2, Период, , ) КАК БонусныеБаллыОстаткиИОбороты
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	 |		ПО (БонусныеБаллыОстаткиИОбороты.Партнер = ПартнерыКонтактнаяИнформация.Ссылка)
	 |			И (&ТипПочта = ПартнерыКонтактнаяИнформация.Тип)
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РезервБонусныхБаллов КАК РезервБонусныхБаллов
	 |		ПО (БонусныеБаллыОстаткиИОбороты.Партнер = РезервБонусныхБаллов.Партнер)
	 |ГДЕ
	 |	БонусныеБаллыОстаткиИОбороты.НачисленоОборот <> 0
	 |	И ЕСТЬNULL(ПартнерыКонтактнаяИнформация.АдресЭП, """") <> """"
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	БонусныеБаллыОстаткиИОбороты.Партнер,
	 |	ЕСТЬNULL(ПартнерыКонтактнаяИнформация.АдресЭП, """"),
	 |	БонусныеБаллыОстаткиИОбороты.Партнер.Наименование";
	 
	 Запрос.УстановитьПараметр("ТипПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	 Вчера= НачалоДня(ТекущаяДата())-1;
	 Запрос.УстановитьПараметр("Дата1", НачалоДня(Вчера));
	 Запрос.УстановитьПараметр("Дата2", КонецДня(Вчера));
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 ВыборкаДетальныеЗаписи= РезультатЗапроса.Выбрать();
	 
	 Возврат ВыборкаДетальныеЗаписи;
 КонецФункции
 
 Функция ПроверкаАдресаПочты(Почта)
	 Если ПустаяСтрока(Почта) Тогда
		 Возврат Ложь;
	 КонецЕсли;
	 
	 мСтрок= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Почта, "@", Истина);
	 Если мСтрок.Количество() <> 2 Тогда
		 Возврат Ложь;
	 КонецЕсли;
	 
	 мСтрок2= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(мСтрок[1], ".", Истина);
	 Если мСтрок.Количество() < 2 Тогда
		 Возврат Ложь;
	 КонецЕсли;
	 
	 Если мСтрок.Количество() > 3 Тогда
		 Возврат Ложь;
	 КонецЕсли;
	 
	 Возврат Истина;
 КонецФункции
 
 Процедура ЗаполнитьПисьмо(Письмо, ВыборкаДетальныеЗаписи, Почта, СкрытаяПочта)
	 УчетнаяЗапись= Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("tg-alterra@yandex.ru", Истина);
	 
	 ТекстHTML= ПолучитьМакет("ТекстHTML").ПолучитьТекст();
	 
	 ТекстHTML= СтрЗаменить(ТекстHTML, "*КлиентФИО*", ВыборкаДетальныеЗаписи.КлиентФИО);
	 
	 Если ВыборкаДетальныеЗаписи.КоличествоПриход > 0 Тогда
		 ТекстHTML= СтрЗаменить(ТекстHTML, "*ФразаНачисленоБаллов*", "На ваш счет начислено "+Строка(ВыборкаДетальныеЗаписи.КоличествоПриход) +" бонусов.");
	 Иначе
		 ТекстHTML= СтрЗаменить(ТекстHTML, "*ФразаНачисленоБаллов*", "");	
	 КонецЕсли;
	 Если ВыборкаДетальныеЗаписи.КоличествоРасход > 0 Тогда
		 ТекстHTML= СтрЗаменить(ТекстHTML, "*ФразаСписаниеБаллов*", "С вашего счета списано "+Строка(ВыборкаДетальныеЗаписи.КоличествоРасход) +" бонусов.");
	 Иначе
		 ТекстHTML= СтрЗаменить(ТекстHTML, "*ФразаСписаниеБаллов*", "");	
	 КонецЕсли;
	 Если ВыборкаДетальныеЗаписи.ВРезервеКонечныйОстаток > 0 Тогда
		 ТекстHTML= СтрЗаменить(ТекстHTML, "*ФразаВРезервеПоЗаказам*", "В резерве по заказам "+Строка(ВыборкаДетальныеЗаписи.ВРезервеКонечныйОстаток) +" бонусов.");
	 Иначе
		 ТекстHTML= СтрЗаменить(ТекстHTML, "*ФразаВРезервеПоЗаказам*", "");	
	 КонецЕсли;
	 
	 ТекстHTML= СтрЗаменить(ТекстHTML, "*Баланс*", Строка(ВыборкаДетальныеЗаписи.КоличествоКонечныйОстаток - ВыборкаДетальныеЗаписи.ВРезервеКонечныйОстаток));
	 
	 //Создаем письмо
	 Письмо.Дата= ТекущаяДата();
	 Письмо.Автор= Пользователи.ТекущийПользователь();
	 Письмо.Автор= ТекущаяДата();
	 Письмо.Ответственный= Пользователи.ТекущийПользователь();
	 Письмо.Важность= Перечисления.ВариантыВажностиВзаимодействия.Низкая;
	 Письмо.Кодировка= "UTF-8"; 
	 Письмо.ОтправительПредставление= "www.tg-alterra.ru - Интернет-магазин";
	 Письмо.СписокПолучателейПисьма= Почта;
	 Письмо.СписокПолучателейСкрытыхКопий= СкрытаяПочта;
	 Письмо.СтатусПисьма= Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
	 Письмо.Текст= "";
	 Письмо.ТекстHTML= ТекстHTML;
	 Письмо.Тема= "Информация по бонусному счету";
	 Письмо.ТипТекста= Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
	 Письмо.УчетнаяЗапись= УчетнаяЗапись;
	 Письмо.Комментарий= "Отправлено автоматически";
	 
	 НоваяСтрока = Письмо.ПолучателиПисьма.Добавить();
	 НоваяСтрока.Представление = Почта;
	 НоваяСтрока.Адрес = Почта;
	 
	 Если не ПустаяСтрока(СкрытаяПочта) Тогда
		 НоваяСтрока = Письмо.ПолучателиСкрытыхКопий.Добавить();
		 НоваяСтрока.Представление = СкрытаяПочта;
		 НоваяСтрока.Адрес = СкрытаяПочта;
	 КонецЕсли;
 КонецПроцедуры
 
 // Отправка из партнера 
 Функция СоздатьПисьмоПартнеру(Партнер)  Экспорт
	 
	 ВыборкаДетальныеЗаписи= ЗапросКБалламПоПартнеру(Партнер);
	 
	 Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		 Почта= ВыборкаДетальныеЗаписи.Почта;
		 
		 Если Не ПроверкаАдресаПочты(Почта) Тогда
			 Сообщить("У партнера "+Партнер+" не корректно задана почта: "+Почта);
			 Возврат Неопределено;
		 КонецЕсли;
		 
		 Письмо=  Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
		 
		 СкрытаяПочта= "";
		 
		 ЗаполнитьПисьмоИндивидуально(Письмо, ВыборкаДетальныеЗаписи, Почта, СкрытаяПочта);
		 
		 Письмо.Записать();
		 Возврат Письмо.Ссылка;
	 Иначе 
		 Возврат Неопределено;
	 КонецЕсли;
 КонецФункции
 
 Процедура ЗаполнитьПисьмоИндивидуально(Письмо, ВыборкаДетальныеЗаписи, Почта, СкрытаяПочта)
	 УчетнаяЗапись= Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("tg-alterra@yandex.ru", Истина);
	 
	 ТекстHTML= ПолучитьМакет("ТекстHTMLИндивидуально").ПолучитьТекст();
	 
	 ТекстHTML= СтрЗаменить(ТекстHTML, "*КлиентФИО*", ВыборкаДетальныеЗаписи.КлиентФИО);
	 
	 ТекстHTML= СтрЗаменить(ТекстHTML, "*Начислено*", Строка(ВыборкаДетальныеЗаписи.КоличествоПриход));
	 ТекстHTML= СтрЗаменить(ТекстHTML, "*Списано*", Строка(ВыборкаДетальныеЗаписи.КоличествоРасход));
	 ТекстHTML= СтрЗаменить(ТекстHTML, "*Резерв*", Строка(ВыборкаДетальныеЗаписи.ВРезервеКонечныйОстаток));
	 ТекстHTML= СтрЗаменить(ТекстHTML, "*Остаток*", Строка(ВыборкаДетальныеЗаписи.КоличествоКонечныйОстаток));
	 
	 //Создаем письмо
	 Письмо.Дата= ТекущаяДата();
	 Письмо.Автор= Пользователи.ТекущийПользователь();
	 Письмо.Автор= ТекущаяДата();
	 Письмо.Ответственный= Пользователи.ТекущийПользователь();
	 Письмо.Важность= Перечисления.ВариантыВажностиВзаимодействия.Низкая;
	 Письмо.Кодировка= "UTF-8"; 
	 Письмо.ОтправительПредставление= "www.tg-alterra.ru - Интернет-магазин";
	 Письмо.СписокПолучателейПисьма= Почта;
	 Письмо.СписокПолучателейСкрытыхКопий= СкрытаяПочта;
	 Письмо.СтатусПисьма= Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
	 Письмо.Текст= "";
	 Письмо.ТекстHTML= ТекстHTML;
	 Письмо.Тема= "Информация по бонусному счету";
	 Письмо.ТипТекста= Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
	 Письмо.УчетнаяЗапись= УчетнаяЗапись;
	 Письмо.Комментарий= "Отправлено из партнера";
	 
	 НоваяСтрока = Письмо.ПолучателиПисьма.Добавить();
	 НоваяСтрока.Представление = Почта;
	 НоваяСтрока.Адрес = Почта;
	 
	 Если не ПустаяСтрока(СкрытаяПочта) Тогда
		 НоваяСтрока = Письмо.ПолучателиСкрытыхКопий.Добавить();
		 НоваяСтрока.Представление = СкрытаяПочта;
		 НоваяСтрока.Адрес = СкрытаяПочта;
	 КонецЕсли;
 КонецПроцедуры
 
 Функция ЗапросКБалламПоПартнеру(Партнер) 
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	БонусныеБаллыОстаткиИОбороты.Партнер КАК Партнер,
	 |	ЕСТЬNULL(ПартнерыКонтактнаяИнформация.АдресЭП, """") КАК Почта,
	 |	БонусныеБаллыОстаткиИОбороты.Партнер.Наименование КАК КлиентФИО,
	 |	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоПриход) КАК НачисленоПриход,
	 |	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоРасход) КАК НачисленоРасход,
	 |	СУММА(ВЫБОР
	 |			КОГДА РезервБонусныхБаллов.Реализация = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	 |				ТОГДА РезервБонусныхБаллов.СуммаБаллов
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК ВРезервеКонечныйОстаток,
	 |	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоКонечныйОстаток) КАК НачисленоКонечныйОстаток
	 |ИЗ
	 |	РегистрНакопления.БонусныеБаллы.ОстаткиИОбороты(, , , , Партнер = &Партнер) КАК БонусныеБаллыОстаткиИОбороты
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	 |		ПО (БонусныеБаллыОстаткиИОбороты.Партнер = ПартнерыКонтактнаяИнформация.Ссылка)
	 |			И (&ТипПочта = ПартнерыКонтактнаяИнформация.Тип)
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РезервБонусныхБаллов КАК РезервБонусныхБаллов
	 |		ПО (БонусныеБаллыОстаткиИОбороты.Партнер = РезервБонусныхБаллов.Партнер)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	БонусныеБаллыОстаткиИОбороты.Партнер,
	 |	ЕСТЬNULL(ПартнерыКонтактнаяИнформация.АдресЭП, """"),
	 |	БонусныеБаллыОстаткиИОбороты.Партнер.Наименование";
	 
	 Запрос.УстановитьПараметр("ТипПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	 Вчера= НачалоДня(ТекущаяДата())-1;
	 Запрос.УстановитьПараметр("Дата1", НачалоДня(Вчера));
	 Запрос.УстановитьПараметр("Дата2", КонецДня(Вчера));
	 Запрос.УстановитьПараметр("Партнер", Партнер);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 ВыборкаДетальныеЗаписи= РезультатЗапроса.Выбрать();
	 
	 Возврат ВыборкаДетальныеЗаписи;
 КонецФункции
 
#КонецЕсли
